Repository: RootCo0/Flexi_Main
Catalog: lib/l10n/app_*.arb
Languages: ar

# onBoardingTitle
source: Stay on top of your fitness with Flexi
ar: إبقي على لياقتك في القمة مع فلكسي

# onBoardingSubTitle
source: With simple steps, you will be able to enter the world of sports and health
ar: بخطوات بسيطة ستستطيع الولوج عالم الرياضة و الصحة

# loginTitle
source: Login
ar: تسجيل دخول

# loginSubTitle
source: Create a new account
ar: انشاء حساب جديد

# enterYourPhone
source: Enter your phone number
ar: ادخل رقم هاتفك

# sendingCodeToVerify
source: You will receive an activation code message to complete the registration process
ar: سوف تصلك رسالة بها رمز التفعيل لكي تكمل عملية التسجيل

# mobileNumber
source: Your phone number
ar: رقم هاتفك

source: Email
ar: بريد اليكتروني

source: Full Name
ar: الاسم الكامل

source: Password
ar: الرقم السري

source: Male
ar: رجل

source: Country
ar: البلد

# birthDate
source: Choose your date of birth
ar: اختر تاريخ ميلادك

# userInfoTitle
source: One last step separates you from Flexi
ar: خطوة اخيرة تفصلك عن فلكسي

source: Female
ar: امرأة

# maleText
source: Improve your experience on Flexi
ar: حسن تجربتك مع فلكسي

# femaleText
source: Improve your experience on Flexi
ar: حسني تجربتك مع فلكسي

# maleBirtDateText
source: Choose the correct age
ar: اختر العمر الصحيح

# femaleBirtDateText
source: Choose the correct age
ar: اختري العمر الصحيح

# genderSubTitle
source: How do you plan to use the Flexi app
ar: كيف تخطط لإستخدام تطبيق فلكسي

# enterCode
source: Enter the verification code
ar: ادخل رمز التحقق

# packageTitle
source: Take your body to the
ar: ارتقي بجسمك للمستوى

# packageSubTitle
source: Wonderful and exclusive features are waiting for you And get additional workout days for free.
ar: مميزات رائعة و حصرية في إنتضارك واحصل على أيام تمرين إضافية مجاناً.

# packageTitleLevel
source: next level
ar: التالي

# homeCoachTitle
source: Professional trainers to help you
ar: مدربين محترفين لمساعدتك في

# homeCoachSubTitle
source: Wonderful and exclusive features await you upon appointment Your personal trainer Additional services for free.
ar: مميزات رائعة و حصرية في إنتضارك عند تعيين مدربك الخاص خدمات إضافية مجاناً.

# homeCoachTitleImmediately
source: immediately
ar: الحال

# searchText
source: Find a producer, personal trainer...
ar: إبحث عن منتج, مدرب خاص...

source: Package Features
ar: مميزات الباقة

# packageFeaturesStartedSubTitle
source: The main package is the first choice for most new buyers and has many advantages.
ar: الباقة الرئيسية هو الخيار الأول لأغلب المشترين الجدد يحتوي على العديد من المميزات.

# packageFeaturesProfSubTitle
source: The Professional package is the choice for practicing people For sports and bodybuilding for a very long timeً
ar: الباقة الإحترافية هو الخيار للأشخاص الممارسين للرياضة و كمال الأجسام لمدة طويلة جداً

# feature1
source: Access to any gym in the Kingdom
ar: الولوج لأي صالة رياضية في المملكة

# feature2
source: Get 2 free days of training as a gift
ar: أحصل على 2 أيام مجانية للتمرين هدية

# feature3
source: Possibility of showering in a 3-star bathroom
ar: إمكانية الإستحمام في حمام صنف 3 نجوم

# feature4
source: The validity of using all sports equipment
ar: صلاحية إستخدام جميع الأجهزة الرياضية

# feature5
source: Possibility to exercise in a private room
ar: إمكانية التمرين في غرفة خاصة

# feature6
source: Meals to eat inside the gym canteen
ar: وجبات للأكل داخل مقصف الجيم

# feature7
source: Access to all floors
ar: اللولوج للجميع الطوابق

# feature8
source: Use of the gym's pool
ar: استخدام المسبح الخاص بالجيم

# feature9
source: Climbing place use in C
ar: استخدام مكان التسلق في جيم

# payWithCard
source: Payment via bank card
ar: الدفع عبر البطاقة المصرفية

# payWithCardSubTitle
source: Flexi platform is currently available on two main packages Starter Package and Professional Package.
ar: منصة فلكسي تتوفر حالية على باقتين رئيسيتين الباقة البدئية و الباقة الإحترافية.

# cardName
source: Card holder name
ar: اسم حامل البطاقة

# cardInfo
source: Card information
ar: معلومات البطاقة

# cardNo
source: Bank card number
ar: رقم البطاقة المصرفية

# bestProduct
source: The best products
ar: أفضل المنتجات

# upgradePackage
source: Package upgrade
ar: ترقية الباقة

# hireTrainer
source: Hire a personal trainer
ar: تعيين مدرب خاص

source: Payment
ar: الدفع

source: Pay now
ar: إدفع الآن

source: Total
ar: المجموع

source: Delivery
ar: التوصيل

source: Discount
ar: الخصم

source: Tax
ar: الضريبة

# qrCodeTitle
source: Pass the code
ar: قم بتمرير الكود

# qrCodeSubTitle
source: Pass the code in front of the service provider (hall reception) To allow everyone to pass easily.
ar: قم بتمرير الكود أمام مزود الخدمة (إستقبال الصالة) لكي يسمح لكل بالمرور بسهولة.

# ourEnd
source: Congrats! You have been subscribed
ar: تهانيناً! لقد تم الإشتراك

# ourEndSubTitle
source: Congrats! You have subscribed to the starter flexi package and you are now Licensed to use all features
ar: مبروك! لقد تم الإشتراك في باقة فلكسي البدئية و أنت الآن مرخص لإستخدام كل المميزات

source: Apply
ar: تطبيق

source: Voucher
ar: كوبون الخصم

source: Start Now
ar: ابدأ الآن

# choosePayment
source: Choose payment method
ar: اختر وسيلة الدفع

# paymentSubTitle
source: Flexi platform is currently available on two main packages Starter Package and Professional Package.
ar: منصة فلكسي تتوفر حالية على باقتين رئيسيتين الباقة البدئية و الباقة الإحترافية.

# havingVoucher
source: Do you have a discount coupon?
ar: هل تملك كوبون خصم؟

source: monthly
ar: شهرياً

source: Market
ar: المتجر

source: View all
ar: عرض الكل

source: Starter Package
ar: الباقة البدئية

# starterPackageSubTitle
source: The starter package is the first choice for most new subscribers and contains many features.
ar: الباقة البدئية هو الخيار الأول لأغلب المشتركين الجدد يحتوي على العديد من المميزات.

source: Professional Package
ar: الباقة الإحترافية

# professionalPackageSubTitle
source: The Professional package is the choice for practicing people For sports and bodybuilding for a very long timeً
ar: الباقة الإحترافية هو الخيار للأشخاص الممارسين للرياضة و كمال الأجسام لمدة طويلة جداً

# choosePackage
source: Choose your preferred package
ar: اختر باقتك المفضلة

# choosePackageSubtitle
source: Flexi platform is currently available on two main packages Starter Package and Professional Package.
ar: منصة فلكسي تتوفر حالياً على باقتين رئيسيتين الباقة البدئية و الباقة الإحترافية.

source: Continue to upgrade
ar: متابعة للترقية

source: free delivery
ar: توصيل مجاني

# checkYourPhone
source: Check your phone, we have sent you a verification code.
ar: تحقق من هاتفك, لقد ارسلنالك رمز التحقق.

source: Results
ar: نتائج البحث

source: Add to cart
ar: أضف للسلة

source: Cart
ar: السلة

# address
source: Choose yor address
ar: اختر العنوان

source: Edit Profile
ar: تعديل الحساب

source: Active Notifications
ar: تفعيل التنبيهات

source: Active Dark Theme
ar: تفعيل الوضع الليلي

source: Coach Mode
ar: وضع المدرب

source: Package Stats
ar: احصائيات الباقة

source: Payment Information
ar: معلومات الدفع

source: Language
ar: اللغة

source: Logout
ar: تسجيل الخروج

source: Job
ar: المهنه

source: Description
ar: الوصف

source: Current Password
ar: كلمة المرور الحالبه

source: New Password
ar: كلمة المرور الجديدة

source: Update
ar: تحديث

# updateDialog
source: Would you like to update Your personal information
ar: هل تود تحديث معلوماتك الشخصية

# updateDialogSubTitle
source: Tritt do not click on Yes to yet Verify your personal information
ar: تريت لا تقم بالضغط على نعم إلى بعد تأكد من معلوماتك الشخصية

source: Yes
ar: نعم

source: Cancel
ar: الغاء

source: English
ar: الانجليزية

source: Arabic
ar: العربية

source: Quantity
ar: العدد

source: Size
ar: المقاس

source: Delivered To
ar: يتم التوصيل إلى

source: Similar Products
ar: منتجات مشابهة

source: Matching results
ar: نتائج مطابقة

# enterUrData
source: Enter your data
ar: ادخل بياناتك
